/* COMMON */
"commonAdd" = "Add";
"commonBasicSettings" = "Basic settings";
"commonCancel" = "Cancel";
"commonDelete" = "Delete";
"commonDosage" = "Dosage";
"commonEgString" = "e.g. %@";
"commonEmptyView" = "There's nothing here right now!";
"commonExampleDosage" = "Example Dosage";
"commonInfo" = "Info";
"commonMedications" = "Medications";
"commonNoDate" = "No date";
"commonNotTakenYet" = "No taken yet";
"commonOK" = "OK";
"commonPleaseSelect" = "Please select or add a dose";
"commonPleaseAdd" = "Please add a medication before adding a dose!";
"commonSave" = "Save";
"commonSort" = "Sort";

"validationTwoLetters" = "%@ must have at least 2 letters";
"validationOneOrAbove" = "%@ must be 1 or above";
"validationMustSpecify" = "You must specify a %@";
"validationMustEmpty" = "%@ must not be empty";

/* TABS / TITLES */
"titleHome" = "Pain Meds Buddy";
"tabTitleHistory" = "History";
"tabTitleHome" = "Home";
"tabTitleInProgress" = "In Progress";
"tabTitleMedications" = "Medications";
"tabTitleSettings" = "Settings";

/* HOME VIEW */
"homeCurrentMeds" = "Current meds";
"homeMedsRunningOut" = "Meds running out";
"homeRecentlyTaken" = "Recently taken";
"homeTakeNext" = "Take Next";
"homeTakeNow" = "Take Now";
"homeAccessibilityIconRemaining" = "%@ %@ icon, %@, %@ %@ remaining";
"homeAccessibilityIconTaken" = "%@ %@ icon, %@ %@ taken %@";
"homeAccessibilityIconTakeNow" = "%@ %@ icon, %@ %@ taken %@, Take Now";
"homeAccessibilityAvailable to take" = "%@, %@, Available to take";

/* DOSE PROGRESS */
"doseProgressAvailable" = "Available";
"doseProgressUnknownMedication" = "Unknown Medication";
"doseProgressAccessibilityAvailable" = "%@, %@, %@ Available to take";
"doseProgressAccessibilityRemaining" = "%@, %@, %@ Remaining";

/* SELECT MED */
"selectMedSelectMed" = "Select Med";

/* DOSE EDIT VIEW */
"doseEditAddDose" = "Add Dose";
"doseEditAreYouSureDelete" = "Are you sure you want to delete this does?";
"doseEditAreYouSureElapse" = "Are you sure you want to set this dose as elapsed?";
"doseEditAmount" = "Amount";
"doseElapsedReminder" = "Elapsed reminder";
"doseElapsedReminderAlertTitle" = "Oops!";
"doseElapsedReminderAlertMessage" = "There was a problem. Please check you have notifications enabled, tap 'Check Settings'.\n\nRemember you can toggle the default 'Remind Me' option from Settings, tap settings from the tab bar.";
"doseElapsedReminderAlertButton" = "Check Settings";
"doseEditDateTime" = "Taken";
"doseEditDeleteDose" = "Delete dose";
"doseEditDeleteThisDose" = "Delete this Dose";
"doseEditDetails" = "Notes";
"doseEditDetailsPlaceholder" = "Optionally add some notes about why you took this medication.";
"doseEditDosageElapsed" = "Elapses %@";
"doseEditEditDose" = "Edit Dose";
"doseEditElapseDose" = "Elapse Dose";
"doseEditMarkElapsed" = "Mark this Dose as elapsed";
"doseEditMedication" = "Medication";
"doseEditInitialNotificationsError" = "It looks like you've disabled notifications. You will not be able to use the reminder feature unless you enabled notifications. By using the toggle you will be prompted to turn on notifications.";

/* SORT POPUP */
"sortOptimised" = "Optimised";
"sortCreatedDate" = "Created Date";
"sortSortOrder" = "Sort Order";
"sortTitle" = "Title";

/* MEDS VIEW */
"medsMedications" = "Medications";
"medsSorryUsed" = "Sorry you can not delete meds used with doses!";
"medsPleaseSelect" = "Please select or add a medication";

/* MED EDIT VIEW */
"medEditTitleLabelAID" = "";
"medEditTitleText" = "";
"medEditGapInfo" = "A duration gap is an additional time you might wish to add between dosages of medication.";
"medEditAddMed" = "Add Med";
"medEditAreYouSure" = "Are you sure you want to delete this med?";
"medEditColour" = "Colour";
"medEditCopyThisMed" = "Copy this med";
"medEditCopied" = "Copied successfully!";
"medEditCopiedSuffix" = "%@ Copy";
"medEditDefaultAmount" = "Default amount";
"medEditDefaultText" = "Default Text";
"medEditDeleteMed" = "Delete med";
"medEditDeleteThisMed" = "Delete this med";
"medEditDurationGap" = "Duration gap";
"medEditDurationGapPickerHourAID" = "";
"medEditDurationGapPickerMinuteAID" = "";
"medEditDuration" = "Duration";
"medEditDurationPickerHourAID" = "";
"medEditDurationPickerMinuteAID" = "";
"medEditEditMed" = "Edit Med";
"medEditForm" = "Form";
"medEditImage" = "Image";
"medEditLockedField" = "This med has been used in a dose and this item cannot be changed.\n\nPlease us the copy feature below if you'd like to create another similar medication.";
"medEditLowToast" = "Your '%@' medication is running low!";
"medEditMeasure" = "Measure";
"medEditMg" = "mg";
"medEditNewMedication" = "New Medication";
"medEditNotes" = "Notes";
"medEditNotesPlaceholder" = "Optionally make some notes about this medication.";
"medEditPill" = "Pills";
"medEditRemaining" = "Remaining";
"medEditSorry" = "Sorry you're using this med with a dose.";
"medEditSymbol" = "Symbol";
"medEditTitle" = "Title";

/* SETTINGS */
"settingsAcknowledgements" = "Acknowledgements";
"settingsAdvanced" = "Advanced";
"settingsAddExampleData" = "Add Example Data";
"settingsAreYouSureDeleteAll" = "Are you sure you want to delete all your data?";
"settingsAreYouSureExampleData" = "Are you sure you want to replace your existing data with example data?";
"settingsAreYouSureCrashTest" = "Are you sure you want to produce a test crash report?";
"settingsCrashTestAlertTitle" = "Crash Test";
"settingsDeleteAllData" = "Delete All Data";
"settingsDeleteAllAlertTitle" = "Delete All";
"settingsDefaultRemindMe" = "Default remind me";
"settingsDefaultRemindMeFooter" = "Whether the remind me field on the med add / edit screen is on or off by default.";
"settingsDeveloper" = "Developer Options";
"settingsExampleDataAlertTitle" = "Example Data";
"settingsGenerateTestCrash" = "Generate test crash";
"settingsNoResponsibility" = "We accept no responsibility for doses / medication information present in this app. Please follow advice from a qualified professional and instructions provided with your medications.";

"notificationSubtitle" = "Your dose has now expired.";

"timePickerHours" = "%@ hrs";
"timePickerMins" = "%@ mins";

/* COLOURS */
"Symbol" = "Symbol";
"Pink" = "Pink";
"Purple" = "Purple";
"Red" = "Red";
"Orange" = "Orange";
"Gold" = "Gold";
"Green" = "Green";
"Teal" = "Teal";
"Light Blue" = "Light Blue";
"Dark Blue" = "Dark Blue";
"Midnight" = "Midnight";
"Dark Gray" = "Dark Gray";
"Gray" = "Gray";

/* SPECIAL */
"%@ %@" = "%1$@ %2$@";
"%d %@" = "%1$d %2$@";
", " = ", ";

/* TO EXCLUDE !! */
"Button 1" = "Button 1";
